def multiplication_table(n):                # สร้างฟังก์ชั่นขึ้นรับค่า จากโจทย์จากนั้น สร้างตัวแปร ขึ้นมากำหนดเป็น list เปล่า
    result  = []                            # สร้างลูปขึ้นมาให้ i ลูปใน range เริ่มจากเลขที่ 1 ถึง n+1 เพราะว่า ถ้าสมมุติ n
    for i in range(1,n+1):                  # เท่ากับ 5 แล้วมันจะวนลูปถึงแค่ 4 จะไม่นับตัวมันเอง จึงต้อง +1 เข้าไป จากนั้น
        a = []                              # สร้างตัวแปรขึ้นมาเป็น list เปล่า แล้วสร้างลูปขึ้นมาให้ j ลูปใน range เริ่มจาก
        for j in range(1,n+1):              # เลข 1 แล้วเหมือนลูปที่แล้ว จากนั้น ให้ เอาค่า j ที่มีคูณกับ ค่า i จากนั้นเก็บค่าไว้ใน
            a.append(j*i)                   # ตัวแปรที่เป็น list a จากนั้น ให้เอา ค่าจาก a ไปเก็บไว้ใน ตัวแปร result จากนั้น
        result.append(a)                    # ก็วนลูปที่ 2 ครั้งที่ 2 จากนั้น ก็ทำเหมือนเดิม จนครบจำนวณ n จากนั้นก็
    return result                           # กลับไปเริ่มลูปที่ 1 ครั้งที่ 2 จากนั้นก็ เหมือนเดิมจนครบจากนั้น return
print(multiplication_table(1))
print(multiplication_table(3))