def sum_fractions(lst):                                             # สร้างฟังก์ชั่นที่รับ list เข้ามา จากนั้น
    a = []                                                          # สร้างตัวแปร a ให้เป็น list เปล่า
    for i in lst:                                                   # สร้างลูปให้ i เช็คใน list และให้
        x = i[0] / i[1]                                             # ก้อนแรกที่เช็ค คือ [18, 13] กำหนดให้ index แรกในก้อนคือ 18
        a.append(x)                                                 # ลบกับ index ที่สองคือ 13 จากนั้น เก็บข้อมูลไว้ในตัวแปร x 
    return round(sum(a))                                            # จากนั้นก็ append หรือ นำค่าที่ได้ไว้ใน ตัวแปรlist a
print(sum_fractions([[18, 13], [4, 5]]))                            # แล้วก็วนลูปอีกครั้ง พอเสร็จลูป จากนั้นทำการนำค่าใน a มา+กัน
print(sum_fractions([[36, 4], [22, 60]]))                           # แล้วปัดเศษ จากนั้นก็ return ออกมา
print(sum_fractions([[11, 2], [3, 4], [5, 4], [21, 11], [12, 6]]))